In [38]:
#1. Exercício: Carregar um arquivo e exibir as primeiras 5 linhas.
import pandas as pd

# 1. Carregar os  dados do arquivo
df = pd.read_excel('dados_ausentes.xlsx')
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria    NaN  Rio de Janeiro   4500.0
2     José   35.0             NaN      NaN
3      Ana   22.0        Salvador   5000.0
4    Pedro    NaN    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0      são paulo    3410.0
7   Carlos   35.0    porto alegre   2500.0

In [39]:
#2. Exercício: Verificar se há valores NaN nas colunas do DataFrame.
print(df.isnull())

    Nome  Idade  Cidade  Salário
0  False  False   False    False
1  False   True   False    False
2  False  False    True     True
3  False  False   False    False
4  False   True   False    False
5  False  False   False    False
6  False  False   False    False
7  False  False   False    False

In [40]:
#3. Exercício: Substituir os valores NaN de uma coluna por 0.
df['Salário'].fillna(0,inplace=True)
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria    NaN  Rio de Janeiro   4500.0
2     José   35.0             NaN      0.0
3      Ana   22.0        Salvador   5000.0
4    Pedro    NaN    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0      são paulo    3410.0
7   Carlos   35.0    porto alegre   2500.0

C:\Users\45014141897\AppData\Local\Temp\ipykernel_23368\2550286830.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salário'].fillna(0,inplace=True)

In [41]:
# 4. Exercício: Substituir os valores NaN de uma coluna por um valor específico
#(por exemplo, a média).
df['Idade'].fillna(df['Idade'].mean(), inplace=True)
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   27.0  Rio de Janeiro   4500.0
2     José   35.0             NaN      0.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   27.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0      são paulo    3410.0
7   Carlos   35.0    porto alegre   2500.0

C:\Users\45014141897\AppData\Local\Temp\ipykernel_23368\3112492151.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Idade'].fillna(df['Idade'].mean(), inplace=True)

In [57]:
#5. Exercício: Remover todas as linhas que contêm valores NaN em qualquer coluna
df_sem_nulos = df.dropna()
print(df_sem_nulos)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [43]:
# 6. Exercício: Remover todas as linhas que contêm valores NaN em uma coluna específica.
df_limpo_cidade = df.dropna(subset=['Cidade'])
print(df_limpo_cidade)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   27.0  Rio de Janeiro   4500.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   27.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0      são paulo    3410.0
7   Carlos   35.0    porto alegre   2500.0

In [56]:
# 7. Exercício: Substituir valores NaN de uma coluna com a mediana dessa coluna.
mediana_idade = df['Idade'].median()
df['Idade'] = df['Idade'].fillna(mediana_idade)

print(mediana_idade)
print(df)

27.0
      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [55]:
# 8. Exercício: Substituir valores NaN de uma coluna com o valor de uma outra coluna.
df['Idade'] = df['Idade'].fillna(df['Salário'])

print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [46]:
# 9. Exercício: Preencher valores NaN com o valor anterior (método de "forward fill").
# df['Cidade'] = df['Cidade'].ffill()
# print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   27.0  Rio de Janeiro   4500.0
2     José   35.0  Rio de Janeiro      0.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   27.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0      são paulo    3410.0
7   Carlos   35.0    porto alegre   2500.0

In [53]:
df['Idade'] = df['Idade'].fillna(df['Salário'])

print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [54]:
# 10. Exercício: Preencher valores NaN com o valor posterior (método de "backward fill").
df['Cidade'] = df['Cidade'].bfill()
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [48]:
# 11. Exercício: Alterar todos os valores de uma coluna para maiúsculas.
df['Cidade'] = df['Cidade'].str.title() 
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   27.0  Rio De Janeiro   4500.0
2     José   35.0  Rio De Janeiro      0.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   27.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0      São Paulo    3410.0
7   Carlos   35.0    Porto Alegre   2500.0

In [49]:
# 12. Exercício: Alterar todos os valores de uma coluna para minúsculas.
df['Cidade'] = df['Cidade'].str.lower() 
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
5      Ana   22.0        salvador   5000.0
6  Jessica   20.0      são paulo    3410.0
7   Carlos   35.0    porto alegre   2500.0

In [50]:
# 13. Exercício: Remover espaços em branco à esquerda e à direita em uma coluna.
df['Cidade'] = df['Cidade'].str.strip() 
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
5      Ana   22.0        salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [51]:
#14. Exercício: Substituir valores de uma coluna com base em um dicionário de mapeamento (ex: "São Paulo" para "SP".)
df['Cidade'].str.lower().replace({'são paulo': 'SP', 'rio de janeiro': 'RJ', 'porto alegre': 'PA'})
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
5      Ana   22.0        salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [52]:
# 15. Exercício: Identificar e remover valores duplicados de um DataFrame.
df = df.drop_duplicates(subset=['Nome'])
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria   27.0  rio de janeiro   4500.0
2     José   35.0  rio de janeiro      0.0
3      Ana   22.0        salvador   5000.0
4    Pedro   27.0    porto alegre   4800.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0